volunteerlogging/app/views/volunteers/index.html.erb

SELECT  `volunteers`.* FROM `volunteers` LIMIT 11
---
  var tbody = "";
  $.each(data, function(key, obj){

    tbody +="<tr>";
    tbody += "<td>"+ obj.volunteer_id + "</td>";
    tbody += "<td>"+ obj.firstName + "</td>";
    tbody += "<td>"+ obj.lastName + "</td>";
    tbody += "<td>"+ obj.email + "</td>";
    tbody += "<td>"+ obj.created_at + "</td>";
    tbody += "<td>"+ obj.phoneNum + "</td>";
    tbody += "<td>"+ obj.volType + "</td>";
    tbody += "<td><a href='volunteers/"+ obj.id +"'>Show</a></td>";
    tbody += "<td><a href='volunteers/"+ obj.id +"/edit'>Edit</a></td>";
    tbody += "<td><a data-method='delete' href='volunteers/"+ obj.id +"'>Delete</a></td>";
    tbody += "</tr>";
  });