volunteerlogging/app/views/admins/volunteers.html.erb

  var tbody = "";
  $.each(data, function(key, obj){

    tbody +="<tr class='trs'  id='"+ obj.volunteer_id + "'>";
    tbody += "<td>"+ obj.volunteer_id + "</td>";
    tbody += "<td id='firstName' value='"+ obj.firstName + "' >"+ obj.firstName + "</td>";
    tbody += "<td id='lastName'>"+ obj.lastName + "</td>";
    tbody += "<td>"+ obj.email + "</td>";
    tbody += "<td>"+ obj.created_at + "</td>";
    tbody += "<td>"+ obj.phoneNum + "</td>";
    tbody += "<td>"+ obj.volType + "</td>";
    tbody += "<td><a href='volunteers/"+ obj.id +"'>Show</a></td>";
    tbody += "<td><a href='volunteers/"+ obj.id +"/edit'>Edit</a></td>";
    tbody += "<td><a data-method='delete' href='volunteers/"+ obj.id +"'>Delete</a></td>";
    tbody += "</tr>";
  });
---
SELECT  `volunteers`.* FROM `volunteers` LIMIT 11