volunteerlogging/app/views/events/index.html.erb

SELECT  `events`.* FROM `events` LIMIT 11
---

          $.ajax({url: 'event/showEvent',
            dataType: "json",
            type: "GET",
            data: {id: event.id},
            success: function(data){
              $("#slots").html("");
              var vol = <%= current_volunteer.to_json.html_safe %>
              var a = "";
              var count = 1;
              var signup = true
              data[0].forEach(function(num){
                a = "<div id='slot"+count +"' class='col-5'>  <h3>Slot "+count+"</h3><br>";


                data[num.id].forEach(function(person){


                   a += "<label>"+ person.firstName + " " + person.lastName + "</label>";
                  if(vol.id == person.id){
                    a += "<button name='leave' value='"+num.id+"' class='btn col-3 hover'>Leave Slot</button>";
                  }