volunteerlogging/app/views/volunteer_descriptions/index.html.erb

SELECT `volunteer_descriptions`.* FROM `volunteer_descriptions`
---
  var tbody = "";
  $.each(data, function(key, obj){

    tbody +="<tr>";
    tbody += "<td>"+ obj.volunteer_id + "</td>";
    tbody += "<td>"+ obj.datesAvail + "</td>";
    tbody += "<td>"+ obj.infoVolunteer + "</td>";
    tbody += "<td><a href='volunteer_descriptions/"+ obj.id +"'>Show</a></td>";
    tbody += "<td><a href='volunteer_descriptions/"+ obj.id +"/edit'>Edit</a></td>";
    tbody += "<td><a data-method='delete' href='volunteer_descriptions/"+ obj.id +"'>Delete</a></td>";
    tbody += "</tr>";
  });