volunteerlogging/app/controllers/events_controller.rb

  def admin_cal
    @volunteers = Volunteer.all
---
SELECT `volunteers`.* FROM `volunteers`

  def sign_up
    @hour = Hour.new(hour_params)


    respond_to do |format|
      if @hour.save
---
INSERT INTO `hours` (`hoursWorked`, `section_id`, `volunteer_id`, `created_at`, `updated_at`) VALUES (1, 57, 26, '2017-12-06 07:40:08', '2017-12-06 07:40:08')

  def leave
    v_id =params["hour"]["volunteer_id"]
    section= params["hour"]["section_id"]
    hr_id = Hour.find_by_sql("select id from hours where section_id = #{section} and volunteer_id = #{v_id}")

    hour = Hour.find(hr_id[0].id)
    hour.destroy
---
SELECT  `hours`.* FROM `hours` WHERE `hours`.`id` = NULL LIMIT 1
DELETE FROM `hours` WHERE `hours`.`id` = 6

  def createSections

    event = params["event"]
    repeated = params["event_repeated"]
    @newevent = Event.new(event_params)
    @newevent.save
---
INSERT INTO `events` (`title`, `description`, `start_time`, `end_time`, `numOfSections`, `created_at`, `updated_at`) VALUES ('created first', 'Fuckyea', '2017-12-02 21:19:00', '2017-12-02 23:19:00', 2, '2017-12-02 21:37:48', '2017-12-02 21:37:48')

                     }
                     puts params['section']
      section = Section.new(section_params)
      section.save
---
INSERT INTO `sections` (`event_section`, `start`, `end`, `event_id`, `created_at`, `updated_at`) VALUES (12, '2017-12-02 12:32:00', '2017-12-02 12:32:00', 20, '2017-12-02 22:32:43', '2017-12-02 22:32:43')

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO `events` (`title`, `description`, `start_time`, `end_time`, `numOfSections`, `created_at`, `updated_at`) VALUES ('yes', 'asdf', '2017-12-30 22:54:00', '2017-12-30 22:54:00', 3, '2017-12-02 05:14:38', '2017-12-02 05:14:38')

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE `events` SET `end_time` = '2017-09-30 23:59:00', `updated_at` = '2017-11-30 06:09:24' WHERE `events`.`id` = 1