volunteerlogging/app/controllers/hours_controller.rb

SELECT `hours`.* FROM `hours`
---
  def index
    @hours = Hour.all

SELECT `volunteers`.* FROM `volunteers`
---
  def new
    @hour = Hour.new
    @volunteers = Volunteer.all

INSERT INTO `hours` (`hoursWorked`, `weekWorked`, `section_id`, `volunteer_id`, `created_at`, `updated_at`) VALUES (1, '2017-11-22', 1, 13, '2017-11-30 23:17:35', '2017-11-30 23:17:35')
---
  def create
    @hour = Hour.new(hour_params)

    respond_to do |format|
      if @hour.save

SELECT  `hours`.* FROM `hours` WHERE `hours`.`id` = 2 LIMIT 1
---
    def set_hour
      @hour = Hour.find(params[:id])