volunteerlogging/app/controllers/reports_controller.rb

    def reports
       @volunteers = Volunteer.all
       @hours = Hour.all
---
SELECT `hours`.* FROM `hours`