volunteerlogging/app/controllers/sections_controller.rb

INSERT INTO `sections` (`start`, `end`, `event_id`, `created_at`, `updated_at`) VALUES ('2017-11-30 23:08:00', '2017-11-30 23:08:00', 1, '2017-11-30 23:08:25', '2017-11-30 23:08:25')
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save

SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
    def set_section
      @section = Section.find(params[:id])