volunteerlogging/app/controllers/volunteers_controller.rb

  def index
    @volunteers = Volunteer.all
---
SELECT `volunteers`.* FROM `volunteers`

  def create
    @volunteer = Volunteer.new(volunteer_params)

    respond_to do |format|
      if @volunteer.save
---
INSERT INTO `volunteers` (`volunteer_id`, `firstName`, `lastName`, `dateJoined`, `phoneNum`, `volType`, `created_at`, `updated_at`, `email`, `encrypted_password`) VALUES (23456, 'Laurie', 'Royal', '2017-11-09', '12345678', '1234567890', '2017-11-28 23:03:52', '2017-11-28 23:03:52', '123456@1234567', '$2a$11$.gyfI0nYe3r8XmZWKIw5t.oRYzUFueVpbuDQdU/EiF5gMDxXA9I4W')

  def update
    respond_to do |format|
      if @volunteer.update(volunteer_params)
---
UPDATE `volunteers` SET `volunteer_id` = 43, `firstName` = 'Xavier', `lastName` = 'Royal', `dateJoined` = '2017-11-28', `phoneNum` = '8474181402', `volType` = 'Au Football', `updated_at` = '2017-11-28 06:03:09' WHERE `volunteers`.`id` = 1

  def destroy
    @volunteer.destroy
---
DELETE FROM `volunteers` WHERE `volunteers`.`id` = 2

    def set_volunteer
      @volunteer = Volunteer.find(params[:id])
---
SELECT  `volunteers`.* FROM `volunteers` WHERE `volunteers`.`id` = 1 ORDER BY `volunteers`.`id` ASC LIMIT 1