volunteerlogging/app/controllers/volunteer_descriptions_controller.rb

  def index
    @volunteer_descriptions = VolunteerDescription.all
---
SELECT `volunteer_descriptions`.* FROM `volunteer_descriptions`